## 4월 9일 
# 이전 내용 복습
# ~~~
# 기술통계 - 목적 - 중심경향 측정 - 변동성 측정
# 충심경향 측정 : 평균(산술, 절단, 가중 기하) 중앙값 최빈값 최소 최대
# 변동성 측정 : 범위, 사분위수 범위, 분산, 표준편차
# 이상값(결측값 : 사용자의 잘못 입력 혹은 누락 값) : 예측할수 있는것과 다른값 또는 수집의 오류
# 극단값 : 데이터셋의 극단 - 오류나 비정상 값이라는 증거가 없다면 데이터 유지

# 왜도 : 긍정 왜도, 부정 왜도
# 첨도  : ?

# R - 사용 
# .txt데이터 엑셀을 사용해 .csv로 변환해서 저장
# read.csv()를 사용해서 불러오기
# 문제 - 데이터 분할 

# 벡터 : 단일 타입 배열?
# 리스트 : 복수 타입 배열?
# 배열 : n차원을 가지는 벡터
# 연산 및 인덱싱 


# EDA
# 라인그래프, 산점도, 상자수염(중요), 히스토그램, 


## 추론통계 
# 중심극한정리 : 표본사이즈 >=30 일때 정규분포에 가까워진다
# 표본을 통해 얻은 정보로 모집단을 "추정"한다
# 표준 정규분포 : 분포의 비교?를 위해 평균이 0, 분산이 1인 "표준정규분포"로 표준화 한다
# 1개의 모집단일때의 확률
# 2개의 모집단일때의 확률

## 가설검정
# 모집단의 비교 - 차이의 유무
# H0 귀무가설(증명할 내용과 반대되는 내용), H1 대립가설(증명할 내용)
# p-value(유의확률) : 가설의 채택하는 기준(설정하는 기준에 따라서 채택되는 가설이 달라진다)
# t-test, z-test : 계산(패키지 사용 및 간단한 계산 함수)


## 시험 시작전에 패키지를 설치하는 것까지는 가능
## 개인컴 사용이 가능하지만 그냥 강이실 컴 사용하자
## 초기화 하고 R사용

